---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SpecTypeId..::..Boolean Members
SpecTypeId..::..Boolean Class Properties See Also Send Feedback
---

This class contains constants identifying specs.

The SpecTypeId..::..Boolean type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | YesNo | Yes/No, in discipline Common. |

# See Also

SpecTypeId..::..Boolean Class

Autodesk.Revit.DB Namespace